<script>
  import Meta from '../components/Meta.svelte'

  const metadata = {
    title: 'ก่อนจะเป็นรัฐธรรมนูญ 2560',
    description: 'ก่อนจะเป็นรัฐธรรมนูญ 2560',
    image: 'images/pie.jpg',
    url:'https://elect.in.th/referendum/'
  }
</script>

<style>
  
</style>

<svelte:head>
  <title>ก่อนจะเป็นรัฐธรรมนูญ 2560 - เกี่ยวกับโครงการ</title>
  <Meta {metadata}/>
</svelte:head>

<h1>เกี่ยวกับโครงการ</h1>

<p class="first">
  รัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช 2560 ถูกวิพากษ์วิจารณ์อย่างมากในหลายประเด็น ไม่ว่าจะเป็นที่มาของผู้ร่างรัฐธรรมนูญที่ไม่เป็นประชาธิปไตย การสร้างบทบัญญัติที่วางกระบวนการสืบทอดอำนาจให้กับ คสช. คณะรัฐประหารซึ่งยึดอำนาจการปกครองจากรัฐบาลที่มาจากการเลือกตั้ง การปิดกั้นการแสดงความคิดเห็นเกี่ยวกับการออกเสียงประชามติร่างรัฐธรรมนูญ รวมถึงการกำหนดประเด็นคำถามในการออกเสียงประชามติที่ไม่ชัดเจน ฯลฯ
</p>

<p>
  ก่อนที่รัฐธรรมนูญฉบับนี้จะกำเนิดขึ้นมาได้ ก็มีเหตุการณ์ต่าง ๆ เกิดขึ้นมากมาย ซึ่งมีความเกี่ยวข้องเชื่อมโยงกัน ทั้งจากฝั่งเหตุการณ์ที่สร้างผลสนับสนุน คสช. ในการสร้างรัฐธรรมนูญเพื่อการสืบทอดอำนาจ และฝั่งเหตุการณ์ที่สร้างผลต่อต้าน คสช. ไม่ให้สามารถใช้รัฐธรรมนูญเพื่อสืบทอดอำนาจต่อได้ ซึ่งเหตุการณ์ทั้งสองฝั่งล้วนมีบุคคล กลุ่มบุคคล และองค์กรที่เกี่ยวข้องอย่างหลากหลาย ทั้งจากภาครัฐ ภาคการเมือง และภาคประชาชน
</p>

<p>
  ELECT จะพาทุกคนไปดู Timeline ตั้งแต่เกิดการทำรัฐประหารเมื่อ พ.ศ. 2557 จนถึงการประกาศใช้รัฐธรรมนูญฉบับปัจจุบันเมื่อ พ.ศ. 2560 ผ่านตัวอย่าง “70 เหตุการณ์” เพื่อแสดงให้เห็นว่าก่อนที่จะเกิดเป็นรัฐธรรมนูญ 2560 มีเหตุการณ์อะไรเกิดขึ้นบ้าง รวมถึงผู้ที่มีความเกี่ยวข้องในเรื่องนี้ ทั้งจากฝ่ายสนับสนุนและฝ่ายไม่สนับสนุน คสช. เป็นใคร และทำอะไรที่ส่งผลต่อการเกิดรัฐธรรมนูญ 2560 อันเป็นเครื่องมือสืบทอดอำนาจของ คสช. บ้าง
</p>

<p>
  ที่มาของข้อมูล
</p>

<p>
  http://ethesisarchive.library.tu.ac.th/thesis/2017/TU_2017_5803011310_7591_6090.pdf 
</p>

<p>
  อาสาสมัครร่วมพัฒนา
</p>

<p>
  เขียนโปรแกรม 👩‍💻

  puripant

  ออกแบบ 👩‍🎨

  น้ำใส ศุภวงศ์

  สืบค้นและรวบรวมข้อมูล 🕵️‍♀️

  สิทธิกานต์ ธีระวัฒนชัย

  บรรณาธิการ 👩‍🍳

  ธนิสรา เรืองเดช

  ประสานงานและจัดการอื่น ๆ 🧙‍♀️

  Punch Up, Boonmee Lab
</p>

<p>
  ร่วมพัฒนาโครงการ
</p>

<p>
  ตรวจสอบ ติดตาม และร่วมพัฒนาโปรเจ็กท์ได้ทาง Github โค้ดบนเว็บไซต์ทั้งหมดถูกเปิดเผยแบบสาธารณะเพื่อความโปร่งใสในการดำเนินการและพัฒนา และร่วมเป็นส่วนหนึ่งในการพัฒนา Civil Tech ในประเทศไทย หากคุณต้องการแบ่งปันทักษะด้านพัฒนาระบบ ออกแบบ รวบรวมข้อมูล หรือแบ่งปันข้อมูล รวมทั้งความช่วยเหลือด้านอื่น ๆ สามารถติดต่อได้ที่ contact [at] elect.in.th
</p>

<p>
  นโยบายการนำข้อมูลไปใช้ต่อ
</p>

<p>
  ELECT มีความตั้งใจที่พัฒนาทุกโปรเจ็กต์ให้เป็น Open Source และเปิดข้อมูลเป็น Open Data ภายใต้เงื่อนไข Creative Commons Attribution-ShareAlike License คือสามารถนำไปเผยแพร่และดัดแปลงได้ โดยต้องระบุที่มา แต่ห้ามนำไปใช้เพื่อการค้า และต้องเผยแพร่งานดัดแปลงโดยใช้สัญญาอนุญาตชนิดเดียวกัน

  หากมีข้อสงสัยต้องการสอบถามเพิ่มเติม ประสงค์แจ้งเปลี่ยนแปลงหรือเพิ่มเติมข้อมูลเพื่อความถูกต้อง หรือมีข้อเสนอแนะใด ๆ สามารถติดต่อได้ที่ contact [at] elect.in.th
</p>