<script>
  // import successkid from 'images/successkid.jpg';
</script>

<style>
  
</style>

<svelte:head>
	<title>ก่อนจะเป็นรัฐธรรมนูญ 2560 - เกี่ยวกับโครงการ</title>
</svelte:head>

<h1>เกี่ยวกับโครงการ</h1>

<p>
  รัฐธรรมนูญ 2560 เป็นเครื่องมือสืบทอดอำนาจของ คสช. 
  แต่กว่าที่รัฐธรรมนูญฉบับนี้จะใช้ได้ มีเหตุการณ์และกระบวนการต่าง ๆ ที่เชื่อมโยงอย่างเป็นระบบ 
  จนสร้างกลไกทางกฎหมายซึ่งสนับสนุนการสืบทอดอำนาจและการทำลายประชาธิปไตยในประเทศไทยได้สำเร็จ
  แต่ก็มีความพยายามต่อต้านกระบวนการนี้อย่างสุดความสามารถเช่นกัน 
</p>

<p>
  ลองมาดูกันว่ากว่าจะเป็นรัฐธรรมนูญ 60 ตั้งแต่เกิดการรัฐประหาร 2557 
  จนถึงวันที่รัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช 2560 มีผลใช้บังคับ 
  เกิดอะไรขึ้น ใครอยู่ตรงไหน และทำอะไรบ้าง
</p>

<!-- <figure>
	<img alt="Success Kid" src="{successkid}">
	<figcaption>Have fun with Sapper!</figcaption>
</figure> -->