<script>
  import Meta from "../components/Meta.svelte";

  const metadata = {
    title: "ก่อนจะเป็นรัฐธรรมนูญ 2560",
    description: "ก่อนจะเป็นรัฐธรรมนูญ 2560",
    image: "images/pie.jpg",
    url: "https://elect.in.th/referendum/",
  };
</script>

<style>
  ol {
    list-style: none;
    padding-left: 0;
  }
  ol p:first-of-type {
    font-size: 2em;
    font-family: Kondolar Thai, serif;
    text-align: center;
    line-height: 1.2em;
  }
  ul {
    list-style: none;
    padding-left: 0;
    font-weight: bold;
  }
  ul ul {
    list-style: square;
    padding-left: 2em;
    font-weight: normal;
  }
  ul.thumbup ul {
    list-style: "👍  ";
  }
  ul.thumbdown ul {
    list-style: "👎  ";
  }
  ul ul li {
    margin: 1em 0;
  }
</style>

<svelte:head>
  <title>ก่อนจะเป็นรัฐธรรมนูญ 2560 - บทความสรุป</title>
  <Meta {metadata} />
</svelte:head>

<h1>บทความสรุป</h1>

<p class="first">
  จากตัวอย่างเหตุการณ์ทางการเมืองที่เกิดขึ้นในช่วง พ.ศ. 2557 ถึง พ.ศ. 2560
  สะท้อนให้เห็นว่าจากระยะเวลาเกือบ 3 ปี
  มีความเคลื่อนไหวที่เกี่ยวข้องกับรัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช 2560
  เกิดขึ้นมากมาย โดยแบ่งกลุ่มประเภทเหตุการณ์ที่ส่งผลต่อเรื่องรัฐธรรมนูญ 2560 ได้
  2 ประเภทหลัก ดังนี้
</p>

<ol>
  <li>
    <p>
      สร้างผลสนับสนุนการเกิดขึ้นของรัฐธรรมนูญเพื่อ คสช.
    </p>
    <p>
      ตัวอย่างเหตุการณ์ในกลุ่มนี้เกิดขึ้นโดยภาครัฐ และภาคการเมือง
      ประกอบด้วยตัวอย่างบุคคล กลุ่มบุคคลและองค์กร อย่างเช่น
    </p>

    <ul class="thumbdown">
      <li>
        คณะรักษาความสงบแห่งชาติ (คสช.)
        <ul>
          <li>
            รัฐประหารยึดอำนาจจากรัฐบาลที่มาจากการเลือกตั้ง
            เพื่อปูทางสู่การครองอำนาจอย่างยาวนานผ่านการวางกลไกในรัฐธรรมนูญถาวร
          </li>
          <li>
            ประกาศใช้รัฐธรรมนูญแห่งราชอาณาจักรไทย (ฉบับชั่วคราว) พุทธศักราช 2557
            เพื่อทำให้เกิด สนช. ที่มาจากการคัดเลือกของ คสช.
            มาสนับสนุนการร่างรัฐธรรมนูญเพื่อสืบทอดอำนาจ
          </li>
          <li>
            ประกาศแต่งตั้ง กรธ. ที่มาจากการคัดเลือกของ คสช.
            เพื่อร่างรัฐธรรมนูญที่ให้มีกลไกรับรองการสืบทอดอำนาจของ คสช.
          </li>
          <li>
            ออกประกาศและคำสั่ง คสช. อย่างเช่น ประกาศ คสช. ฉบับที่ 57/2557
            คำสั่งหัวหน้า คสช. ที่ 3/2558
            เพื่อนำมาใช้เพื่อปิดปากประชาชนและพรรคการเมืองไม่ให้แสดงความคิดเห็นเกี่ยวกับร่างรัฐธรรมนูญ
            และการทำประชามติ 
          </li>
        </ul>
      </li>
      <li>
        สภานิติบัญญัติแห่งชาติ (สนช.)
        <ul>
          <li>
            เห็นชอบร่างรัฐธรรมนูญแห่งราชอาณาจักรไทย (ฉบับชั่วคราว) พุทธศักราช
            2557 แก้ไขเพิ่มเติม (ฉบับที่ 1)
            ที่เปิดทางให้มีการตั้งคณะกรรมการร่างรัฐธรรมนูญ (กรธ.)
          </li>
          <li>
            เห็นชอบร่างรัฐธรรมนูญแห่งราชอาณาจักรไทย (ฉบับชั่วคราว) พุทธศักราช
            2557 แก้ไขเพิ่มเติม (ฉบับที่ 2) ที่เปิดทางให้ สนช.
            สามารถเสนอประเด็นคำถามเพิ่มเติม (คำถามพ่วง)
            ในการออกเสียงประชามติร่างรัฐธรรมนูญ
          </li>
          <li>
            เห็นชอบประเด็นคำถามพ่วงในการทำประชามติร่างรัฐธรรมนูญซึ่งจะส่งให้
            กกต.ที่เปิดทางให้ ส.ว. 250 คน ที่มาจากการคัดเลือกของ คสช.
            สามารถร่วมโหวตเลือกนายกรัฐมนตรีได้
          </li>
          <li>
            เห็นชอบร่างพระราชบัญญัติว่าด้วยการออกเสียงประชามติร่างรัฐธรรมนูญ
            ที่มีเนื้อหาบางส่วนเอื้อให้เกิดการตีความเพื่อจำกัดเสรีภาพในการแสดงความคิดเห็นของประชาชนเรื่องร่างรัฐธรรมนูญและการทำประชามติอย่างเกินสมควร
          </li>
          <li>
            เห็นชอบร่างรัฐธรรมนูญแห่งราชอาณาจักรไทย (ฉบับชั่วคราว) พุทธศักราช
            2557 แก้ไขเพิ่มเติม (ฉบับที่ 4)
            ที่เปิดทางให้นายกรัฐมนตรีสามารถขอรับร่างรัฐธรรมนูญที่ผ่านการออกเสียงประชามติจากพระมหากษัตริย์
            กลับมาแก้ไขเพิ่มเติมได้
          </li>
        </ul>
      </li>
      <li>
        คณะกรรมการร่างรัฐธรรมนูญ (กรธ.)
        <ul>
          <li>
            ร่างรัฐธรรมนูญ ที่ประธาน กรธ. ให้ฉายาว่า "รัฐธรรมนูญปราบโกง"
            ซึ่งมีประเด็นปัญหาทั้งส่วนที่มาของผู้ร่างรัฐธรรมนูญที่ไม่เป็นประชาธิปไตย
            และเนื้อหาของรัฐธรรมนูญที่มีวางกระบวนการสืบทอดอำนาจของ คสช.
            อย่างเพียบพร้อม
          </li>
          <li>
            จัดทำคำอธิบายสาระสำคัญของร่างรัฐธรรมนูญ 2560
            ซึ่งได้รับเสียงวิจารณ์ว่า
            มีแต่เนื้อหาที่ชี้ให้เห็นแต่ข้อดีของร่างรัฐธรรมนูญเพียงอย่างเดียว
          </li>
        </ul>
      </li>
      <li>
        คณะกรรมการการเลือกตั้ง (กกต.)
        <ul>
          <li>
            ออกประกาศเรื่องการกําหนดวันออกเสียงประชามติที่มีเนื้อหาแสดงการรับรองคำถามพ่วงอันสนับสนุนให้เกิดการสืบทอดอำนาจของ
            คสช. ซึ่งถูกส่งมาจากที่ประชุม สนช.
          </li>
          <li>
            จัดกิจกรรมและเวทีเสวนาต่าง ๆ
            ที่มีบรรยากาศไม่เอื้อให้มีการแสดงความคิดเห็นต่อร่างรัฐธรรมนูญและการทำประชามติอย่างเป็นธรรมแก่ทุกฝ่าย
          </li>
          <li>
            จัดให้มีการออกเสียงประชามติร่างรัฐธรรมนูญ
            โดยที่ไม่สามารถสร้างบรรยากาศให้ประชาชนสามารถแสดงความคิดเห็นต่อร่างรัฐธรรมนูญและการทำประชามติได้อย่างเสรีและปลอดภัย
          </li>
        </ul>
      </li>
      <li>
        ศาลรัฐธรรมนูญ
        <ul>
          <li>
            วินิจฉัยว่า พ.ร.บ.ว่าด้วยการออกเสียงประชามติร่างรัฐธรรมนูญ พ.ศ. 2559
            ที่มีเนื้อหาบางส่วนเอื้อให้เกิดการตีความเพื่อจำกัดเสรีภาพในการแสดงความคิดเห็นของประชาชนอย่างเกินสควร
            ไม่ขัดหรือแย้งต่อรัฐธรรมนูญแห่งราชอาณาจักรไทย (ฉบับชั่วคราว)
            พุทธศักราช 2557
          </li>
          <li>
            วินิจฉัยว่า กรธ. สามารถปรับแก้เนื้อหาร่างรัฐธรรมนูญเรื่องอำนาจ ส.ว.
            ร่วมเสนอชื่อนายกรัฐมนตรีคนนอก ภายหลังการทำประชามติได้
          </li>
          <li>
            วินิจฉัยว่า กรธ. สามารถปรับปรุงคำปรารภร่างรัฐธรรมนูญ
            ภายหลังการทำประชามติได้
          </li>
        </ul>
      </li>
      <li>
        คณะกรรมการประชาชนเพื่อการเปลี่ยนแปลงประเทศไทยให้เป็นประชาธิปไตยที่สมบูรณ์อันมีพระมหากษัตริย์ทรงเป็นประมุข
        (กปปส.)
        <ul>
          <li>
            สุเทพ เทือกสุบรรณ เลขาธิการ กปปส. ให้สัมภาษณ์ชื่นชมร่างรัฐธรรมนูญ
            และจัดเฟซบุ๊กไลฟ์ เพื่อพูดสนับสนุนร่างรัฐธรรมนูญ
          </li>
        </ul>
      </li>
    </ul>
  </li>

  <li>
    <p>
      สร้างผลต่อต้านการเกิดขึ้นของรัฐธรรมนูญเพื่อ คสช.
    </p>
    <p>
      ตัวอย่างเหตุการณ์ในกลุ่มนี้เกิดขึ้นโดยภาคการเมือง และภาคประชาชน
      ประกอบด้วยตัวอย่างบุคคล กลุ่มบุคคลและองค์กร อย่างเช่น
    </p>

    <ul class="thumbup">
      <li>
        พรรคเพื่อไทย
        <ul>
          <li>
            ออกแถลงการณ์หลายฉบับที่มีเนื้อหาวิพากษ์วิจารณ์เนื้อหาร่างรัฐธรรมนูญและคำถามพ่วง
            และเรียกร้องให้สร้างบรรยากาศประชามติที่เสรีเป็นธรรม
            ไม่จำกัดสิทธิเสรีภาพของประชาชนในการแสดงความคิดเห็น
          </li>
          <li>
            แกนนำพรรคเพื่อไทยหลายคน
            ร่วมแสดงจุดยืนไม่เห็นชอบร่างรัฐธรรมนูญและคำถามพ่วง
          </li>
          <li>
            ยิ่งลักษณ์ ชินวัตร อดีตนายกรัฐมนตรีสายเพื่อไทย
            โพสต์ข้อความในเฟซบุ๊กแสดงจุดยืนไม่เห็นชอบร่างรัฐธรรมนูญและคำถามพ่วง
          </li>
        </ul>
      </li>
      <li>
        พรรคประชาธิปัตย์
        <ul>
          <li>
            ตัวแทนคณะกรรมการบริหารพรรคประชาธิปัตย์ แถลงจุดยืนไม่รับคำถามพ่วง
            และเรียกร้องให้ กกต. จัดประชามติอย่างเสรี และเป็นธรรม
          </li>
          <li>
            อภิสิทธิ์ เวชชาชีวะ
            แถลงจุดยืนในฐานะหัวหน้าพรรคประชาธิปัตย์ไม่รับร่างรัฐธรรมนูญฉบับลงประชามติ
            (แต่เสนอให้ คสช. นำรัฐธรรมนูญฉบับปี 2550 มาปรับแก้ไข เพื่อใช้แทน)
          </li>
        </ul>
      </li>
      <li>
        แนวร่วมประชาธิปไตยต่อต้านเผด็จการแห่งชาติ (นปช.)
        <ul>
          <li>
            แกนนำ นปช. หลายคน ประกาศไม่รับร่างรัฐธรรมนูญ
            และเรียกร้องให้สร้างบรรยากาศการทำประชามติที่ไม่อยู่ในความกลัว
          </li>
          <li>
            ประกาศเปิด "ศูนย์ปราบโกงประชามติ" ทั่วประเทศ (แต่ทำไม่สำเร็จ
            เพราะถูกเจ้าหน้าที่รัฐขัดขวาง)
          </li>
        </ul>
      </li>
      <li>
        เครือข่ายนักวิชาการเพื่อสิทธิพลเมือง (คนส.)
        <ul>
          <li>
            ออกแถลงการณ์หลายฉบับที่มีเนื้อหายืนยันเสรีภาพในการแสดงความคิดเห็นเรื่องร่างรัฐธรรมนูญและการทำประชามติ
            รวมถึงเรียกร้องให้ปล่อยตัวประชาชนที่ออกมารณรงค์เรื่องการทำประชามติ
          </li>
          <li>
            นักวิชาการของ คนส. หลายคน
            ร่วมแสดงจุดยืนไม่รับร่างรัฐธรรมนูญและคำถามพ่วง
          </li>
        </ul>
      </li>
      <li>
        คณะนิติราษฎร์
        <ul>
          <li>
            ออกแถลงการณ์แสดงจุดยืนไม่รับร่างรัฐธรรมนูญ
            และวิพากษ์วิจารณ์หลักเกณฑ์การออกเสียงประชามติ
          </li>
          <li>
            ส่งตัวแทนกลุ่มเข้าร่วมงานเสวนาวิชาการที่เกี่ยวกับการวิพากษ์วิจารณ์ร่างรัฐธรรมนูญและการทำประชามติ
          </li>
        </ul>
      </li>
      <li>
        โครงการอินเทอร์เน็ตเพื่อกฎหมายประชาชน (iLaw)
        <ul>
          <li>
            ยื่นหนังสือให้ผู้ตรวจการแผ่นดินส่งเรื่องให้ศาลรัฐธรรมนูญวินิจฉัยว่า
            พ.ร.บ. ว่าด้วยการออกเสียงประชามติร่างรัฐธรรมนูญ พ.ศ. 2559
            มีเนื้อหาที่ขัดต่อรัฐธรรมนูญหรือไม่
          </li>
          <li>
            ร่วมกับองค์กรภาคประชาชนและกลุ่มเคลื่อนไหวต่าง ๆ
            จัดกิจกรรมเกี่ยวกับการแสดงจุดยืนไม่รับร่างรัฐธรรมนูญและคำถามพ่วง
          </li>
          <li>
            ส่งตัวแทนกลุ่มเข้าร่วมงานเสวนาวิชาการที่เกี่ยวกับการวิพากษ์วิจารณ์ร่างรัฐธรรมนูญและการทำประชามติ
          </li>
        </ul>
      </li>
      <li>
        ขบวนการประชาธิปไตยใหม่ (New Democracy Movement หรือ NDM)
        <ul>
          <li>
            จัดทำแผ่นพับและเอกสารต่าง ๆ
            ที่เกี่ยวข้องกับการรณรงค์ประชามติร่างรัฐธรรมนูญ
            และแสดงจุดยืนไม่รับร่างรัฐธรรมนูญและคำถามพ่วง
          </li>
          <li>
            จัดงานเสวนาและกิจกรรมที่เกี่ยวกับการเรียกร้องให้ประชาชนสามารถแสดงความคิดเห็นต่อร่างรัฐธรรมนูญและการทำประชามติได้อย่างเสรี
          </li>
        </ul>
      </li>
    </ul>
  </li>
</ol>