<script>
  import Meta from '../components/Meta.svelte'

  const metadata = {
    title: 'ก่อนจะเป็นรัฐธรรมนูญ 2560',
    description: 'ก่อนจะเป็นรัฐธรรมนูญ 2560',
    image: 'images/pie.jpg',
    url:'https://elect.in.th/referendum/'
  }
</script>

<style>

</style>

<svelte:head>
  <title>ก่อนจะเป็นรัฐธรรมนูญ 2560 - บทความ</title>
  <Meta {metadata}/>
</svelte:head>

<h1>บทความ</h1>

<p>
  สรุปข้อมูลบุคคล คณะบุคคล และองค์กรต่าง ๆ ว่าเป็นใคร มาจากไหน 
  และมีการกระทำการใด ๆ ที่เกี่ยวข้องกับการเกิดรัฐธรรมนูญ 2560 ขึ้นมา 
  ตาม 3 กลุ่มใหญ่ (ภาครัฐ ภาคการเมือง และภาคประชาชน)
</p>

<p>
  สรุปข้อมูลลักษณะเหตุการณ์ที่เกี่ยวข้องกับการเกิดรัฐธรรมนูญ 2560 
  เกิดขึ้นในลักษณะใดบ้าง เช่น การผ่านกฎหมาย การออกแถลงการณ์ การจัดเสวนา การเคลื่อนไหว ฯลฯ
</p>
